inference/load_testing/vegeta/text_gen/summarization/falcon/results_falcon.txt
Requests      [total, rate, throughput]         5, 6.25, 5.94
Duration      [total, attack, wait]             841.054ms, 799.971ms, 41.084ms
Latencies     [min, mean, 50, 90, 95, 99, max]  41.073ms, 41.546ms, 41.111ms, 42.912ms, 42.912ms, 42.912ms, 42.912ms
Bytes In      [total, mean]                     105, 21.00
Bytes Out     [total, mean]                     1720, 344.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5
Error Set:
Requests      [total, rate, throughput]         5, 6.25, 5.95
Duration      [total, attack, wait]             841.038ms, 799.994ms, 41.044ms
Latencies     [min, mean, 50, 90, 95, 99, max]  40.865ms, 41.37ms, 41.126ms, 42.672ms, 42.672ms, 42.672ms, 42.672ms
Bytes In      [total, mean]                     105, 21.00
Bytes Out     [total, mean]                     1715, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5
Error Set:
Requests      [total, rate, throughput]         5, 6.25, 5.95
Duration      [total, attack, wait]             840.755ms, 799.998ms, 40.756ms
Latencies     [min, mean, 50, 90, 95, 99, max]  40.756ms, 41.256ms, 40.914ms, 42.749ms, 42.749ms, 42.749ms, 42.749ms
Bytes In      [total, mean]                     105, 21.00
Bytes Out     [total, mean]                     1715, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5
Error Set:
Requests      [total, rate, throughput]         15, 16.07, 15.39
Duration      [total, attack, wait]             974.403ms, 933.336ms, 41.067ms
Latencies     [min, mean, 50, 90, 95, 99, max]  40.747ms, 41.053ms, 40.879ms, 41.264ms, 42.156ms, 42.453ms, 42.453ms
Bytes In      [total, mean]                     315, 21.00
Bytes Out     [total, mean]                     5145, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15
Error Set:
Requests      [total, rate, throughput]         15, 16.07, 15.40
Duration      [total, attack, wait]             974.07ms, 933.287ms, 40.783ms
Latencies     [min, mean, 50, 90, 95, 99, max]  40.604ms, 40.95ms, 40.826ms, 41.095ms, 42.105ms, 42.441ms, 42.441ms
Bytes In      [total, mean]                     315, 21.00
Bytes Out     [total, mean]                     5145, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15
Error Set:
Requests      [total, rate, throughput]         15, 16.07, 15.40
Duration      [total, attack, wait]             973.998ms, 933.287ms, 40.712ms
Latencies     [min, mean, 50, 90, 95, 99, max]  40.588ms, 40.868ms, 40.712ms, 41.046ms, 42.313ms, 42.735ms, 42.735ms
Bytes In      [total, mean]                     315, 21.00
Bytes Out     [total, mean]                     5100, 340.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15
Error Set:
Requests      [total, rate, throughput]         25, 26.04, 24.99
Duration      [total, attack, wait]             1s, 959.89ms, 40.57ms
Latencies     [min, mean, 50, 90, 95, 99, max]  40.5ms, 40.981ms, 40.818ms, 41.829ms, 42.257ms, 42.489ms, 42.489ms
Bytes In      [total, mean]                     525, 21.00
Bytes Out     [total, mean]                     8350, 334.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:25
Error Set:
Requests      [total, rate, throughput]         25, 26.04, 24.98
Duration      [total, attack, wait]             1.001s, 959.998ms, 40.783ms
Latencies     [min, mean, 50, 90, 95, 99, max]  40.569ms, 41.087ms, 40.801ms, 42.076ms, 42.121ms, 42.244ms, 42.244ms
Bytes In      [total, mean]                     525, 21.00
Bytes Out     [total, mean]                     8575, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:25
Error Set:
Requests      [total, rate, throughput]         25, 26.04, 24.98
Duration      [total, attack, wait]             1.001s, 959.95ms, 40.757ms
Latencies     [min, mean, 50, 90, 95, 99, max]  40.377ms, 40.86ms, 40.781ms, 41.343ms, 41.902ms, 42.206ms, 42.206ms
Bytes In      [total, mean]                     525, 21.00
Bytes Out     [total, mean]                     6775, 271.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:25
Error Set:
Requests      [total, rate, throughput]         35, 36.03, 33.16
Duration      [total, attack, wait]             1.056s, 971.374ms, 84.226ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.54ms, 91.283ms, 90.312ms, 115.91ms, 123.175ms, 127.615ms, 127.615ms
Bytes In      [total, mean]                     735, 21.00
Bytes Out     [total, mean]                     12005, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:35
Error Set:
Requests      [total, rate, throughput]         35, 36.03, 33.43
Duration      [total, attack, wait]             1.047s, 971.439ms, 75.385ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.546ms, 90.36ms, 88.89ms, 116.494ms, 122.966ms, 125.939ms, 125.939ms
Bytes In      [total, mean]                     735, 21.00
Bytes Out     [total, mean]                     12040, 344.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:35
Error Set:
Requests      [total, rate, throughput]         35, 36.03, 33.44
Duration      [total, attack, wait]             1.047s, 971.441ms, 75.07ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.674ms, 89.987ms, 88.528ms, 116.04ms, 122.481ms, 125.369ms, 125.369ms
Bytes In      [total, mean]                     735, 21.00
Bytes Out     [total, mean]                     12005, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:35
Error Set:
Requests      [total, rate, throughput]         45, 46.03, 42.65
Duration      [total, attack, wait]             1.055s, 977.689ms, 77.375ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.617ms, 94.324ms, 95.373ms, 121.822ms, 124.515ms, 126.813ms, 126.813ms
Bytes In      [total, mean]                     945, 21.00
Bytes Out     [total, mean]                     15030, 334.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:45
Error Set:
Requests      [total, rate, throughput]         45, 46.03, 42.56
Duration      [total, attack, wait]             1.057s, 977.712ms, 79.684ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.466ms, 93.453ms, 94.153ms, 119.487ms, 124.275ms, 126.343ms, 126.343ms
Bytes In      [total, mean]                     945, 21.00
Bytes Out     [total, mean]                     15435, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:45
Error Set:
Requests      [total, rate, throughput]         45, 46.03, 42.70
Duration      [total, attack, wait]             1.054s, 977.624ms, 76.292ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.667ms, 94.78ms, 96.551ms, 122.099ms, 124.537ms, 126.795ms, 126.795ms
Bytes In      [total, mean]                     945, 21.00
Bytes Out     [total, mean]                     15030, 334.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:45
Error Set:
Requests      [total, rate, throughput]         55, 56.02, 45.01
Duration      [total, attack, wait]             1.222s, 981.816ms, 240.092ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.653ms, 220.167ms, 227.04ms, 316.256ms, 335.97ms, 372.006ms, 372.919ms
Bytes In      [total, mean]                     1155, 21.00
Bytes Out     [total, mean]                     18865, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:55
Error Set:
Requests      [total, rate, throughput]         55, 56.02, 45.06
Duration      [total, attack, wait]             1.221s, 981.79ms, 238.86ms
Latencies     [min, mean, 50, 90, 95, 99, max]  43.092ms, 232.059ms, 238.86ms, 351.856ms, 372.323ms, 408.077ms, 408.987ms
Bytes In      [total, mean]                     1155, 21.00
Bytes Out     [total, mean]                     18865, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:55
Error Set:
Requests      [total, rate, throughput]         55, 56.03, 49.19
Duration      [total, attack, wait]             1.118s, 981.644ms, 136.58ms
Latencies     [min, mean, 50, 90, 95, 99, max]  43.001ms, 167.413ms, 170.141ms, 231.336ms, 238.029ms, 249.388ms, 249.591ms
Bytes In      [total, mean]                     1155, 21.00
Bytes Out     [total, mean]                     14905, 271.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:55
Error Set:
Requests      [total, rate, throughput]         65, 66.01, 49.92
Duration      [total, attack, wait]             1.302s, 984.638ms, 317.382ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.755ms, 294.78ms, 299.259ms, 437.231ms, 486.115ms, 526.256ms, 528.621ms
Bytes In      [total, mean]                     1365, 21.00
Bytes Out     [total, mean]                     21710, 334.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:65
Error Set:
Requests      [total, rate, throughput]         65, 66.02, 48.72
Duration      [total, attack, wait]             1.334s, 984.59ms, 349.591ms
Latencies     [min, mean, 50, 90, 95, 99, max]  43.542ms, 320.374ms, 327.402ms, 493.919ms, 543.565ms, 583.396ms, 585.682ms
Bytes In      [total, mean]                     1365, 21.00
Bytes Out     [total, mean]                     22100, 340.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:65
Error Set:
Requests      [total, rate, throughput]         65, 66.02, 53.34
Duration      [total, attack, wait]             1.219s, 984.615ms, 233.974ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.464ms, 248.081ms, 252.083ms, 350.724ms, 372.89ms, 389.801ms, 390.192ms
Bytes In      [total, mean]                     1365, 21.00
Bytes Out     [total, mean]                     17615, 271.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:65
Error Set:
Requests      [total, rate, throughput]         75, 76.02, 53.18
Duration      [total, attack, wait]             1.41s, 986.599ms, 423.574ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.664ms, 364.865ms, 380.332ms, 539.922ms, 590.029ms, 629.784ms, 633.115ms
Bytes In      [total, mean]                     1575, 21.00
Bytes Out     [total, mean]                     25050, 334.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:75
Error Set:
Requests      [total, rate, throughput]         75, 76.01, 55.86
Duration      [total, attack, wait]             1.343s, 986.685ms, 355.905ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.547ms, 317.043ms, 326.11ms, 489.004ms, 538.973ms, 578.606ms, 581.905ms
Bytes In      [total, mean]                     1575, 21.00
Bytes Out     [total, mean]                     20325, 271.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:75
Error Set:
Requests      [total, rate, throughput]         75, 76.01, 51.47
Duration      [total, attack, wait]             1.457s, 986.677ms, 470.414ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.6ms, 404.3ms, 403.96ms, 648.821ms, 698.817ms, 738.301ms, 741.651ms
Bytes In      [total, mean]                     1575, 21.00
Bytes Out     [total, mean]                     25500, 340.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:75
Error Set:
Requests      [total, rate, throughput]         85, 86.01, 58.15
Duration      [total, attack, wait]             1.462s, 988.24ms, 473.532ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.469ms, 412.876ms, 415.843ms, 660.168ms, 710.618ms, 749.819ms, 753.778ms
Bytes In      [total, mean]                     1785, 21.00
Bytes Out     [total, mean]                     23035, 271.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:85
Error Set:
Requests      [total, rate, throughput]         85, 86.02, 52.28
Duration      [total, attack, wait]             1.626s, 988.165ms, 637.712ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.882ms, 526.618ms, 569.616ms, 802.355ms, 828.695ms, 868.092ms, 872.115ms
Bytes In      [total, mean]                     1785, 21.00
Bytes Out     [total, mean]                     29155, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:85
Error Set:
Requests      [total, rate, throughput]         85, 86.02, 52.77
Duration      [total, attack, wait]             1.611s, 988.184ms, 622.433ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.621ms, 517.846ms, 553.522ms, 787.109ms, 813.312ms, 853.184ms, 857.362ms
Bytes In      [total, mean]                     1785, 21.00
Bytes Out     [total, mean]                     28900, 340.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:85
Error Set:
Requests      [total, rate, throughput]         95, 96.01, 54.08
Duration      [total, attack, wait]             1.757s, 989.444ms, 767.16ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.767ms, 671.327ms, 690.122ms, 1.084s, 1.133s, 1.173s, 1.178s
Bytes In      [total, mean]                     1995, 21.00
Bytes Out     [total, mean]                     32585, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:95
Error Set:
Requests      [total, rate, throughput]         95, 96.01, 56.45
Duration      [total, attack, wait]             1.683s, 989.467ms, 693.568ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.507ms, 558.445ms, 604.072ms, 845.265ms, 870.758ms, 890.198ms, 892.755ms
Bytes In      [total, mean]                     1995, 21.00
Bytes Out     [total, mean]                     31730, 334.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:95
Error Set:
Requests      [total, rate, throughput]         95, 96.01, 56.48
Duration      [total, attack, wait]             1.682s, 989.436ms, 692.698ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.665ms, 558.172ms, 603.588ms, 845.399ms, 870.304ms, 889.865ms, 892.13ms
Bytes In      [total, mean]                     1995, 21.00
Bytes Out     [total, mean]                     31730, 334.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:95
Error Set:
Requests      [total, rate, throughput]         105, 106.02, 61.32
Duration      [total, attack, wait]             1.712s, 990.389ms, 721.972ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.872ms, 620.008ms, 646.302ms, 1.004s, 1.053s, 1.093s, 1.099s
Bytes In      [total, mean]                     2205, 21.00
Bytes Out     [total, mean]                     28455, 271.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:105
Error Set:
Requests      [total, rate, throughput]         105, 106.01, 55.07
Duration      [total, attack, wait]             1.907s, 990.447ms, 916.075ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.849ms, 752.466ms, 855.793ms, 1.084s, 1.107s, 1.128s, 1.132s
Bytes In      [total, mean]                     2205, 21.00
Bytes Out     [total, mean]                     36015, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:105
Error Set:
Requests      [total, rate, throughput]         105, 106.02, 57.09
Duration      [total, attack, wait]             1.839s, 990.413ms, 848.663ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.82ms, 703.901ms, 790.44ms, 1.018s, 1.06s, 1.098s, 1.103s
Bytes In      [total, mean]                     2205, 21.00
Bytes Out     [total, mean]                     35070, 334.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:105
Error Set:
Requests      [total, rate, throughput]         115, 116.01, 56.50
Duration      [total, attack, wait]             2.035s, 991.331ms, 1.044s
Latencies     [min, mean, 50, 90, 95, 99, max]  42.713ms, 841.982ms, 979.522ms, 1.223s, 1.272s, 1.312s, 1.318s
Bytes In      [total, mean]                     2415, 21.00
Bytes Out     [total, mean]                     38410, 334.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:115
Error Set:
Requests      [total, rate, throughput]         115, 116.01, 60.66
Duration      [total, attack, wait]             1.896s, 991.273ms, 904.441ms
Latencies     [min, mean, 50, 90, 95, 99, max]  43.252ms, 734.391ms, 798.927ms, 1.13s, 1.179s, 1.219s, 1.224s
Bytes In      [total, mean]                     2415, 21.00
Bytes Out     [total, mean]                     31165, 271.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:115
Error Set:
Requests      [total, rate, throughput]         115, 116.01, 60.67
Duration      [total, attack, wait]             1.896s, 991.274ms, 904.257ms
Latencies     [min, mean, 50, 90, 95, 99, max]  42.448ms, 734.198ms, 798.945ms, 1.13s, 1.179s, 1.219s, 1.225s
Bytes In      [total, mean]                     2415, 21.00
Bytes Out     [total, mean]                     31165, 271.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:115
Error Set:
Requests      [total, rate, throughput]         125, 126.00, 57.17
Duration      [total, attack, wait]             2.186s, 992.033ms, 1.194s
Latencies     [min, mean, 50, 90, 95, 99, max]  42.556ms, 936.646ms, 1.087s, 1.338s, 1.362s, 1.383s, 1.389s
Bytes In      [total, mean]                     2625, 21.00
Bytes Out     [total, mean]                     41750, 334.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:125
Error Set:
Requests      [total, rate, throughput]         125, 126.02, 51.86
Duration      [total, attack, wait]             2.41s, 991.939ms, 1.418s
Latencies     [min, mean, 50, 90, 95, 99, max]  42.707ms, 1.057s, 1.278s, 1.546s, 1.591s, 1.631s, 1.636s
Bytes In      [total, mean]                     2625, 21.00
Bytes Out     [total, mean]                     42500, 340.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:125
Error Set:
Requests      [total, rate, throughput]         125, 126.01, 51.82
Duration      [total, attack, wait]             2.412s, 991.976ms, 1.42s
Latencies     [min, mean, 50, 90, 95, 99, max]  42.719ms, 1.058s, 1.279s, 1.548s, 1.592s, 1.632s, 1.638s
Bytes In      [total, mean]                     2625, 21.00
Bytes Out     [total, mean]                     42500, 340.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:125
Error Set:
Requests      [total, rate, throughput]         135, 136.01, 61.99
Duration      [total, attack, wait]             2.178s, 992.586ms, 1.185s
Latencies     [min, mean, 50, 90, 95, 99, max]  42.561ms, 905.835ms, 1.031s, 1.311s, 1.36s, 1.4s, 1.406s
Bytes In      [total, mean]                     2835, 21.00
Bytes Out     [total, mean]                     36585, 271.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:135
Error Set:
Requests      [total, rate, throughput]         135, 136.01, 52.07
Duration      [total, attack, wait]             2.592s, 992.606ms, 1.6s
Latencies     [min, mean, 50, 90, 95, 99, max]  42.721ms, 1.156s, 1.392s, 1.695s, 1.718s, 1.748s, 1.755s
Bytes In      [total, mean]                     2835, 21.00
Bytes Out     [total, mean]                     45900, 340.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:135
Error Set:
Requests      [total, rate, throughput]         135, 136.02, 61.95
Duration      [total, attack, wait]             2.179s, 992.491ms, 1.187s
Latencies     [min, mean, 50, 90, 95, 99, max]  42.753ms, 906.545ms, 1.032s, 1.312s, 1.362s, 1.402s, 1.408s
Bytes In      [total, mean]                     2835, 21.00
Bytes Out     [total, mean]                     36585, 271.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:135
Error Set:
Requests      [total, rate, throughput]         145, 146.01, 53.85
Duration      [total, attack, wait]             2.693s, 993.08ms, 1.7s
Latencies     [min, mean, 50, 90, 95, 99, max]  43.007ms, 1.204s, 1.326s, 1.851s, 1.901s, 1.941s, 1.946s
Bytes In      [total, mean]                     3045, 21.00
Bytes Out     [total, mean]                     49735, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:145
Error Set:
Requests      [total, rate, throughput]         145, 146.01, 54.21
Duration      [total, attack, wait]             2.675s, 993.059ms, 1.682s
Latencies     [min, mean, 50, 90, 95, 99, max]  42.777ms, 1.201s, 1.429s, 1.752s, 1.793s, 1.833s, 1.84s
Bytes In      [total, mean]                     3045, 21.00
Bytes Out     [total, mean]                     49735, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:145
Error Set:
Requests      [total, rate, throughput]         145, 146.01, 53.53
Duration      [total, attack, wait]             2.709s, 993.077ms, 1.716s
Latencies     [min, mean, 50, 90, 95, 99, max]  43.19ms, 1.215s, 1.344s, 1.86s, 1.91s, 1.95s, 1.956s
Bytes In      [total, mean]                     3045, 21.00
Bytes Out     [total, mean]                     49735, 343.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:145
Error Set: